const promise=require("promise")
module.exports={
    musamma:()=>{

       
        var name=["പിതാവ്","മാതാവ്","മകന്‍","മകള്‍","ഭര്‍ത്താവ്","ഭാര്യ","പൂര്‍ണ്ണ സഹോദരന്‍","പൂര്‍ണ്ണ സഹോദരി","പേരമകന്‍",
        "പേരമകള്‍","പിതാമഹന്‍","മാതാമഹന്‍","മാതാമഹി","ഏകപിതാ സഹോദരന്‍","ഏകപിതാ സഹോദരി",
        "ഏകമാതാ സഹോദരന്‍","ഏകമാതാ സഹോദരി","പൂര്‍ണ്ണ സഹോദരപുത്രന്‍","ഏകപിതാ സഹോദരപുത്രന്‍","പിതൃവ്യന്‍","ഏകപിതാ പിതൃവ്യന്‍","പിതൃവ്യപുത്രന്‍","ഏകപിതാ പിതൃവ്യപുത്രന്‍"];

        var input=["father","mother","son","daughter","husband","wife","fullBrother","fullSister","grandSon",
        "grandDaughter","grandFather","grandMother","grandMother2","paternalBrother","paternalSister",
        "maternalBrother","maternalSister","nephew2","nephew1","uncle2","uncle1","cousin2","cousin1"]
        
        var condition=[
            "",
            "",
            "ദത്തുപുത്രന്‍ ഉള്‍പ്പെടില്ല.",
            "ദത്തുപുത്രി ഉള്‍പ്പെടില്ല.",
            "",
            "റജ്ഇയ്യ ത്വലാഖിന്‍റെ ഇദ്ദയിലുള്ള ഭാര്യയും ഉള്‍പ്പെടും.",
            "ഒരേ പിതാവിലും മാതാവിലും ഉള്ള സഹോദരന്‍",
            "ഒരേ പിതാവിലും മാതാവിലും ഉള്ള സഹോദരി",
            "മകന്‍റെ മകന്‍ മാത്രം, മകളുടെ മകന്‍ ഉള്‍പ്പെടില്ല.",
            "മകന്‍റെ മകള്‍ മാത്രം, മകളുടെ മകള്‍ ഉള്‍പ്പെടില്ല.",
            "പിതാവിന്‍റെ പിതാവ് മാത്രം, മാതാവിന്‍റെ പിതാവ് ഉള്‍പ്പെടില്ല",
            "പിതാവിന്‍റെ മാതാവ്",
            "മാതാവിന്‍റെ's മാതാവ്",
            "ഒരേ പിതാവിലും വ്യത്യസ്ത മാതാവിലും ഉള്ള സഹോദരന്‍",
            "ഒരേ പിതാവിലും വ്യത്യസ്ത മാതാവിലും ഉള്ള സഹോദരി",
            "ഒരേ മാതാവിലും വ്യത്യസ്ത പിതാവിലും ഉള്ള സഹോദരന്‍",
            "ഒരേ മാതാവിലും വ്യത്യസ്ത പിതാവിലും ഉള്ള സഹോദരി",
            "",
            "",
            "പിതാവിന്‍റെ പൂര്‍ണ്ണ സഹോദരന്‍",
            "പിതാവിന്‍റെ  ഏകപിതാ സഹോദരന്‍",
            "പിതാവിന്‍റെ പൂര്‍ണ്ണ സഹോദരന്‍റെ പുത്രന്‍",
            "പിതാവിന്‍റെ  ഏകപിതാ സഹോദരന്‍റെ പുത്രന്‍",




        


        ]

        var headings=[
            "INTRODUCTION",
            "LIABLILITES ON INHERITANCE",
            "INHERITANCE",
            "HEIRS OF INHERITANCE",
            "PRESCRIBED SHARES OF HEIRS",
            "AL THA'SEEB",
            "AL HAJB",
            "AL AUL",
            "AL RADD"
        ]
        
            return({name,input,condition,headings})
        
    },
    numbers:(relatives,callback)=>{
        return new promise((resolve,reject)=>{
            
        })
    }
}
